_site/abc218-e-upsolving/index.html
<div id="outline-container-org2383df9" class="outline-2">
<h2 id="org2383df9">E - Destruction</h2>
<div class="outline-text-2" id="text-org2383df9">
<ul class="org-ul">
<li>undirected graph가 주어졌을 때, edge를 지우면서, 그 가중치를 얻을 수 있음</li>
<li>큰 가중치를 지워야 하고, 작은 가중치는 연결해야 함.</li>
<li>음수의 가중치는 무조건 연결해야 함 (이게 안보였던 조건)</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb5b352" class="outline-2">
<h2 id="orgcb5b352">접근하기</h2>
<div class="outline-text-2" id="text-orgcb5b352">
<ul class="org-ul">
<li>모든 가중치를 처음에 더해서 sum에 저장</li>
<li>Minimum Spanning Tree를 약간 변경해서 풀이
<ul class="org-ul">
<li>Union Find와 크루스컬 알고리즘을 이용함</li>
</ul></li>
<li>음수 가중치는 무조건 연결하고, 양수 가중치는 작은 순서로 추가
<ul class="org-ul">
<li>sort하고, 진행함</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb1cd41a" class="outline-2">
<h2 id="orgb1cd41a">코드</h2>
<div class="outline-text-2" id="text-orgb1cd41a">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">ARR_SIZE</span> 200020
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">parent</span>[ARR_SIZE];

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cost</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[ARR_SIZE];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.cost - p2.cost) &lt; 0; 
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">find</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (num == parent[num])
        <span style="color: #729fcf; font-weight: bold;">return</span> num; 
    <span style="color: #729fcf; font-weight: bold;">else</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> parent[num] = find(parent[num]);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">unite</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num1</span> = find(n1);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num2</span> = find(n2);

    <span style="color: #729fcf; font-weight: bold;">if</span> (num1 != num2) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (num1 &gt; num2) {
            parent[num1] = n2;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            parent[num2] = n1;
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;M);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;=N;i++) {
        parent[i] = i;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #ff6347;">e</span>, <span style="color: #ff6347;">cost</span>;
    <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;s, &amp;e, &amp;cost);
        a[i].s = s;
        a[i].e = e;
        a[i].cost = cost;

        sum += cost;
    }
    sort(a, a+M, comp); 

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = find(a[i].s);
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span> = find(a[i].e);
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">v</span> = a[i].cost;

        <span style="color: #729fcf; font-weight: bold;">if</span> (v &lt;= 0) {<span style="color: #888a85;">// </span><span style="color: #888a85;">cost&#44032; &#51020;&#49688;&#51060;&#47732; &#47924;&#51312;&#44148; &#52628;&#44032;</span>
            unite(n1, n2);
            sum = sum - v;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {<span style="color: #888a85;">// </span><span style="color: #888a85;">cost&#44032; &#50577;&#49688;&#51060;&#47732; Minimum Spanning Tree&#47196; &#52628;&#44032;</span>
            <span style="color: #729fcf; font-weight: bold;">if</span> (n1 != n2) {
                unite(n1, n2);
                sum = sum - v;
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%lld\n"</span>, sum);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org34c184c" class="outline-2">
<h2 id="org34c184c">문제 링크</h2>
<div class="outline-text-2" id="text-org34c184c">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc218/tasks/abc218_e">https://atcoder.jp/contests/abc218/tasks/abc218_e</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdb543f3" class="outline-2">
<h2 id="orgdb543f3">참고자료</h2>
<div class="outline-text-2" id="text-orgdb543f3">
<ul class="org-ul">
<li><a href="https://m.blog.naver.com/kks227/220799105543">라이 Minimum Spanning Tree</a></li>
</ul>
</div>
</div>
